/*
09: 請使用switch指令，撰寫一個可以讓使用者從鍵盤輸入一個年度所得淨額後，程式能夠計算出綜合所得稅的須扣稅金額，
綜合所得稅課徵方式採累進稅率制，稅率表如下: 

所得淨額	稅率
0 ~   520,000	5%
520,001 ~ 1,170,000	12%
1,170,001 ~ 2,350,000	20%
2,350,001 ~ 4,400,000	30%
4,400,001以上	40%
 
例如：一位竹科工程師xx的所得淨額為1,500,000元時，扣稅金額為:
=520000*0.05 + (1170000-520000)*0.12 + (1500000-1170001)*0.2 = 170000
也就是，所得淨額在不同的金額範圍，稅率不同，上面的例子所得淨額為一百五十萬，所以有三個不同範圍稅額要加起來，請寫一個程式計算扣稅金額。
 輸入值：所得淨額 (0 - 6,000,000之間)。
 輸出值：扣稅金額。


*/

#include <stdio.h>
#include <stdlib.h>
int main()
{
	int a;
	printf("請輸入一個年度所得淨額：");
	scanf("%d",&a);
	fflush(stdin);
	
		switch (a)
		{
			case 0 ... 520000 :
				printf("扣稅金額 ： %.0lf \n",a*0.05);
			break;
		
			case 520001 ... 1170000 :
				printf("扣稅金額 ： %.0lf \n",(520000*0.05)+(a-520001)*0.12);
			break;
		
			case 1170001 ... 2350000 :
				printf("扣稅金額 ： %.0lf \n",(520000*0.05)+(1170000-520001)*0.12+(a-1170001)*0.2);
			break;
		
			case 2350001 ... 4400000 :
				printf("扣稅金額 ： %.0lf \n",(520000*0.05)+(1170000-520001)*0.12+(2350000-1170001)*0.2,(a-2350001)*0.3);
			break;
		
			case 4400001 ... 6000000 :
				printf("扣稅金額 ： %.0lf \n",(520000*0.05)+(1170000-520001)*0.12+(2350000-1170001)*0.2,(4400000-2350001)*0.3+(a-4400001)*0.4);
			break;
			
			default :
				printf("重新輸入");
			break;
		}
	
	system("pause");
	return 0;
 }

